stevenj/avr-libc3/include/avr/io/atmega16a.h
/******************************************************************************
 *   This file is part of avr-libc3.                                          * 
 *                                                                            * 
 *   Automatically created by devtools/gen-ioheader-atdf.py (V0.91)           * 
 *                                                                            * 
 *   .atpack File: ATmega16A.atdf                                             * 
 *   .ATDF File:   atdf/ATmega16A.atdf                                        * 
 *   Version:      2.0.12                                                     * 
 *   Date:         2019-04-26                                                 * 
 *   Device:       ATmega16A                                                  * 
 *   Architecture: AVR8                                                       * 
 *                                                                            * 
 *   Changelog:                                                               * 
 *                                                                            * 
 *   2.0.12 2019-04-26 :                                                      * 
 *        - Added missing registers and corrceted event generator list for    * 
 *        - mega4809/4808/3209/3208/1609/1608/809/808.                        * 
 *    2.0.2 2019-01-24 :                                                      * 
 *        - Succeeds Atmel.ATmega_DFP 1.3.300.                                * 
 *                                                                            * 
 *   Generated Source Derived from data:                                      * 
 *   Copyright (c) 2019 Microchip Technology Inc.                             * 
 *                                                                            * 
 *   Licensed under the Apache License, Version 2.0 (the "License");          * 
 *   you may not use this file except in compliance with the License.         * 
 *   You may obtain a copy of the Licence at                                  * 
 *                                                                            * 
 *       http://www.apache.org/licenses/LICENSE-2.0                           * 
 *                                                                            * 
 *   Unless required by applicable law or agreed to in writing, software      * 
 *   distributed under the License is distributed on an "AS IS" BASIS,        * 
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. * 
 *   See the License for the specific language governing permissions and      * 
 *   limitations under the License.                                           * 
 ******************************************************************************/


#ifndef _AVR_IO_H_
#  error "Include <avr/io.h> instead of this file."
#endif

#ifndef _AVR_IOXXX_H_
#  define _AVR_IOXXX_H_ "ioATmega16A.h"
#else
#  error "Attempt to include more than one <avr/ioXXX.h> file."
#endif

#ifndef _AVR_ATmega16A_H_INCLUDED
#  define _AVR_ATmega16A_H_INCLUDED

/*
================================================================================
Ungrouped common register
================================================================================
*/

#define SFIOR  _SFR_MEM8 (0x50) /* Special function I/O register */
#define OSCCAL _SFR_MEM8 (0x51) /* Oscillator Calibration Value */

#define MCUCSR _SFR_MEM8 (0x54) /* MCU Control And Status Register */
#define MCUCR  _SFR_MEM8 (0x55) /* MCU Control Register */

#define SP     _SFR_MEM16(0x5D) /* Stack Pointer  */
#define SREG   _SFR_MEM8 (0x5F) /* Status Register */


/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

#if !defined (__ASSEMBLER__)
/*
================================================================================
IO Module Structures
================================================================================
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/

typedef struct FUSE_struct
{
    register8_t LOW; 
    register8_t HIGH;
} FUSE_t;


/* On-Chip Debug Enabled */
typedef enum FUSE_OCDEN_enum
{
    FUSE_OCDEN_CLEAR_gc = (0x00), /* On-Chip Debug Enabled - CLEAR */
    FUSE_OCDEN_SET_gc   = (0x80), /* On-Chip Debug Enabled - SET */
} FUSE_OCDEN_t;

/* JTAG Interface Enabled */
typedef enum FUSE_JTAGEN_enum
{
    FUSE_JTAGEN_CLEAR_gc = (0x00), /* JTAG Interface Enabled - CLEAR */
    FUSE_JTAGEN_SET_gc   = (0x40), /* JTAG Interface Enabled - SET */
} FUSE_JTAGEN_t;

/* Serial program downloading (SPI) enabled */
typedef enum FUSE_SPIEN_enum
{
    FUSE_SPIEN_CLEAR_gc = (0x00), /* Serial program downloading (SPI) enabled - CLEAR */
    FUSE_SPIEN_SET_gc   = (0x20), /* Serial program downloading (SPI) enabled - SET */
} FUSE_SPIEN_t;

/* Preserve EEPROM through the Chip Erase cycle */
typedef enum FUSE_EESAVE_enum
{
    FUSE_EESAVE_CLEAR_gc = (0x00), /* Preserve EEPROM through the Chip Erase cycle - CLEAR */
    FUSE_EESAVE_SET_gc   = (0x08), /* Preserve EEPROM through the Chip Erase cycle - SET */
} FUSE_EESAVE_t;

/* Select Boot Size */
typedef enum FUSE_BOOTSZ_enum
{
    FUSE_BOOTSZ_128W_1F80_gc  = (0x03<<1), /* Boot Flash size=128 words start address=$1F80 */
    FUSE_BOOTSZ_256W_1F00_gc  = (0x02<<1), /* Boot Flash size=256 words start address=$1F00 */
    FUSE_BOOTSZ_512W_1E00_gc  = (0x01<<1), /* Boot Flash size=512 words start address=$1E00 */
    FUSE_BOOTSZ_1024W_1C00_gc = (0x00<<1), /* Boot Flash size=1024 words start address=$1C00 */
} FUSE_BOOTSZ_t;

/* Boot Reset vector Enabled */
typedef enum FUSE_BOOTRST_enum
{
    FUSE_BOOTRST_CLEAR_gc = (0x00), /* Boot Reset vector Enabled - CLEAR */
    FUSE_BOOTRST_SET_gc   = (0x01), /* Boot Reset vector Enabled - SET */
} FUSE_BOOTRST_t;

/* CKOPT fuse (operation dependent of CKSEL fuses) */
typedef enum FUSE_CKOPT_enum
{
    FUSE_CKOPT_CLEAR_gc = (0x00), /* CKOPT fuse (operation dependent of CKSEL fuses) - CLEAR */
    FUSE_CKOPT_SET_gc   = (0x10), /* CKOPT fuse (operation dependent of CKSEL fuses) - SET */
} FUSE_CKOPT_t;

/* Brownout detector trigger level */
typedef enum FUSE_BODLEVEL_enum
{
    FUSE_BODLEVEL_4V0_gc = (0x00<<7), /* Brown-out detection at VCC=4.0 V */
    FUSE_BODLEVEL_2V7_gc = (0x01<<7), /* Brown-out detection at VCC=2.7 V */
} FUSE_BODLEVEL_t;

/* Brown-out detection enabled */
typedef enum FUSE_BODEN_enum
{
    FUSE_BODEN_CLEAR_gc = (0x00), /* Brown-out detection enabled - CLEAR */
    FUSE_BODEN_SET_gc   = (0x40), /* Brown-out detection enabled - SET */
} FUSE_BODEN_t;

/* Select Clock Source */
typedef enum FUSE_SUT_CKSEL_enum
{
    FUSE_SUT_CKSEL_EXTCLK_6CK_0MS_gc                = (0x00), /* Ext. Clock; Start-up time: 6 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTCLK_6CK_4MS_gc                = (0x10), /* Ext. Clock; Start-up time: 6 CK + 4 ms */
    FUSE_SUT_CKSEL_EXTCLK_6CK_64MS_gc               = (0x20), /* Ext. Clock; Start-up time: 6 CK + 64 ms */
    FUSE_SUT_CKSEL_INTRCOSC_1MHZ_6CK_0MS_gc         = (0x01), /* Int. RC Osc. 1 MHz; Start-up time: 6 CK + 0 ms */
    FUSE_SUT_CKSEL_INTRCOSC_1MHZ_6CK_4MS_gc         = (0x11), /* Int. RC Osc. 1 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_SUT_CKSEL_INTRCOSC_1MHZ_6CK_64MS_gc        = (0x21), /* Int. RC Osc. 1 MHz; Start-up time: 6 CK + 64 ms */
    FUSE_SUT_CKSEL_INTRCOSC_2MHZ_6CK_0MS_gc         = (0x02), /* Int. RC Osc. 2 MHz; Start-up time: 6 CK + 0 ms */
    FUSE_SUT_CKSEL_INTRCOSC_2MHZ_6CK_4MS_gc         = (0x12), /* Int. RC Osc. 2 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_SUT_CKSEL_INTRCOSC_2MHZ_6CK_64MS_gc        = (0x22), /* Int. RC Osc. 2 MHz; Start-up time: 6 CK + 64 ms */
    FUSE_SUT_CKSEL_INTRCOSC_4MHZ_6CK_0MS_gc         = (0x03), /* Int. RC Osc. 4 MHz; Start-up time: 6 CK + 0 ms */
    FUSE_SUT_CKSEL_INTRCOSC_4MHZ_6CK_4MS_gc         = (0x13), /* Int. RC Osc. 4 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_SUT_CKSEL_INTRCOSC_4MHZ_6CK_64MS_gc        = (0x23), /* Int. RC Osc. 4 MHz; Start-up time: 6 CK + 64 ms */
    FUSE_SUT_CKSEL_INTRCOSC_8MHZ_6CK_0MS_gc         = (0x04), /* Int. RC Osc. 8 MHz; Start-up time: 6 CK + 0 ms */
    FUSE_SUT_CKSEL_INTRCOSC_8MHZ_6CK_4MS_gc         = (0x14), /* Int. RC Osc. 8 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_SUT_CKSEL_INTRCOSC_8MHZ_6CK_64MS_gc        = (0x24), /* Int. RC Osc. 8 MHz; Start-up time: 6 CK + 64 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_18CK_0MS_gc    = (0x05), /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_18CK_4MS_gc    = (0x15), /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 4 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_18CK_64MS_gc   = (0x25), /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 64 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_6CK_4MS_gc     = (0x35), /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_18CK_0MS_gc  = (0x06), /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_18CK_4MS_gc  = (0x16), /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 4 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_18CK_64MS_gc = (0x26), /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 64 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_6CK_4MS_gc   = (0x36), /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_18CK_0MS_gc   = (0x07), /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_18CK_4MS_gc   = (0x17), /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 4 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_18CK_64MS_gc  = (0x27), /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 64 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_6CK_4MS_gc    = (0x37), /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_18CK_0MS_gc  = (0x08), /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 0 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_18CK_4MS_gc  = (0x18), /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 4 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_18CK_64MS_gc = (0x28), /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 64 ms */
    FUSE_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_6CK_4MS_gc   = (0x38), /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 6 CK + 4 ms */
    FUSE_SUT_CKSEL_EXTLOFXTAL_1KCK_4MS_gc           = (0x09), /* Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4 ms */
    FUSE_SUT_CKSEL_EXTLOFXTAL_1KCK_64MS_gc          = (0x19), /* Ext. Low-Freq. Crystal; Start-up time: 1K CK + 64 ms */
    FUSE_SUT_CKSEL_EXTLOFXTAL_32KCK_64MS_gc         = (0x29), /* Ext. Low-Freq. Crystal; Start-up time: 32K CK + 64 ms */
    FUSE_SUT_CKSEL_EXTLOFXTALRES_258CK_4MS_gc       = (0x0A), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 4 ms */
    FUSE_SUT_CKSEL_EXTLOFXTALRES_258CK_64MS_gc      = (0x1A), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 64 ms */
    FUSE_SUT_CKSEL_EXTLOFXTALRES_1KCK_0MS_gc        = (0x2A), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 0 ms */
    FUSE_SUT_CKSEL_EXTLOFXTALRES_1KCK_4MS_gc        = (0x3A), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 4 ms */
    FUSE_SUT_CKSEL_EXTLOFXTALRES_1KCK_64MS_gc       = (0x0B), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 64 ms */
    FUSE_SUT_CKSEL_EXTLOFXTALRES_16KCK_0MS_gc       = (0x1B), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 0 ms */
    FUSE_SUT_CKSEL_EXTLOFXTALRES_16KCK_4MS_gc       = (0x2B), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 4 ms */
    FUSE_SUT_CKSEL_EXTLOFXTALRES_16KCK_64MS_gc      = (0x3B), /* Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 64 ms */
    FUSE_SUT_CKSEL_EXTMEDFXTALRES_258CK_4MS_gc      = (0x0C), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 4 ms */
    FUSE_SUT_CKSEL_EXTMEDFXTALRES_258CK_64MS_gc     = (0x1C), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 64 ms */
    FUSE_SUT_CKSEL_EXTMEDFXTALRES_1KCK_0MS_gc       = (0x2C), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 0 ms */
    FUSE_SUT_CKSEL_EXTMEDFXTALRES_1KCK_4MS_gc       = (0x3C), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 4 ms */
    FUSE_SUT_CKSEL_EXTMEDFXTALRES_1KCK_64MS_gc      = (0x0D), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 64 ms */
    FUSE_SUT_CKSEL_EXTMEDFXTALRES_16KCK_0MS_gc      = (0x1D), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 0 ms */
    FUSE_SUT_CKSEL_EXTMEDFXTALRES_16KCK_4MS_gc      = (0x2D), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 4 ms */
    FUSE_SUT_CKSEL_EXTMEDFXTALRES_16KCK_64MS_gc     = (0x3D), /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 64 ms */
    FUSE_SUT_CKSEL_EXTHIFXTALRES_258CK_4MS_gc       = (0x0E), /* Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 4 ms */
    FUSE_SUT_CKSEL_EXTHIFXTALRES_258CK_64MS_gc      = (0x1E), /* Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 64 ms */
    FUSE_SUT_CKSEL_EXTHIFXTALRES_1KCK_0MS_gc        = (0x2E), /* Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 0 ms */
    FUSE_SUT_CKSEL_EXTHIFXTALRES_1KCK_4MS_gc        = (0x3E), /* Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 4 ms */
    FUSE_SUT_CKSEL_EXTHIFXTALRES_1KCK_64MS_gc       = (0x0F), /* Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 64 ms */
    FUSE_SUT_CKSEL_EXTHIFXTALRES_16KCK_0MS_gc       = (0x1F), /* Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 0 ms */
    FUSE_SUT_CKSEL_EXTHIFXTALRES_16KCK_4MS_gc       = (0x2F), /* Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 4 ms */
    FUSE_SUT_CKSEL_EXTHIFXTALRES_16KCK_64MS_gc      = (0x3F), /* Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 64 ms */
} FUSE_SUT_CKSEL_t;

