stevenj/avr-libc3/include/avr/io/atmega16a.h
/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
WDT - Watchdog Timer
--------------------------------------------------------------------------------
*/


/* RW */
#define WDT_WDTOE_CLEAR_gc (0x00) /* RW - CLEAR */
#define WDT_WDTOE_SET_gc   (0x10) /* RW - SET */


/* Watch Dog Enable */
#define WDT_WDE_CLEAR_gc (0x00) /* Watch Dog Enable - CLEAR */
#define WDT_WDE_SET_gc   (0x08) /* Watch Dog Enable - SET */


/* Watch Dog Timer Prescaler bits */
#define WDT_WDP_VAL_0x00_gc (0x00) /* Oscillator Cycles 16K */
#define WDT_WDP_VAL_0x01_gc (0x01) /* Oscillator Cycles 32K */
#define WDT_WDP_VAL_0x02_gc (0x02) /* Oscillator Cycles 64K */
#define WDT_WDP_VAL_0x03_gc (0x03) /* Oscillator Cycles 128K */
#define WDT_WDP_VAL_0x04_gc (0x04) /* Oscillator Cycles 256K */
#define WDT_WDP_VAL_0x05_gc (0x05) /* Oscillator Cycles 512K */
#define WDT_WDP_VAL_0x06_gc (0x06) /* Oscillator Cycles 1024K */
#define WDT_WDP_VAL_0x07_gc (0x07) /* Oscillator Cycles 2048K */

#endif

/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* TC0 - Timer/Counter, 8-bit (0x0000) */
#define TC8_BASE         _SFR_MEM8 (0x0000) /* TC8 Base Address */
#define TC8_SFIOR        _SFR_MEM8 (0x0050) /* Special Function IO Register */
#define TC8_TCNT0        _SFR_MEM8 (0x0052) /* Timer/Counter 0 Register */
#define TC8_TCCR0        _SFR_MEM8 (0x0053) /* Timer/Counter Control Register */
#define TC8_TIFR         _SFR_MEM8 (0x0058) /* Timer/Counter Interrupt Flag register */
#define TC8_TIMSK        _SFR_MEM8 (0x0059) /* Timer/Counter Interrupt Mask Register */
#define TC8_OCR0         _SFR_MEM8 (0x005C) /* Output Compare 0 Register */

/* TC1 - Timer/Counter, 16-bit (0x0000) */
#define TC16_BASE        _SFR_MEM16(0x0000) /* TC16 Base Address */
#define TC16_ICR1        _SFR_MEM16(0x0046) /* Timer/Counter1 Input Capture Register Bytes */
#define TC16_ICR1L       _SFR_MEM8 (0x0046) /* Timer/Counter1 Input Capture Register Bytes LOW BYTE */
#define TC16_ICR1H       _SFR_MEM8 (0x0047) /* Timer/Counter1 Input Capture Register Bytes HIGH BYTE */
#define TC16_OCR1B       _SFR_MEM16(0x0048) /* Timer/Counter1 Output Compare Register Bytes */
#define TC16_OCR1BL      _SFR_MEM8 (0x0048) /* Timer/Counter1 Output Compare Register Bytes LOW BYTE */
#define TC16_OCR1BH      _SFR_MEM8 (0x0049) /* Timer/Counter1 Output Compare Register Bytes HIGH BYTE */
#define TC16_OCR1A       _SFR_MEM16(0x004A) /* Timer/Counter1 Output Compare Register Bytes */
#define TC16_OCR1AL      _SFR_MEM8 (0x004A) /* Timer/Counter1 Output Compare Register Bytes LOW BYTE */
#define TC16_OCR1AH      _SFR_MEM8 (0x004B) /* Timer/Counter1 Output Compare Register Bytes HIGH BYTE */
#define TC16_TCNT1       _SFR_MEM16(0x004C) /* Timer/Counter1 Bytes */
#define TC16_TCNT1L      _SFR_MEM8 (0x004C) /* Timer/Counter1 Bytes LOW BYTE */
#define TC16_TCNT1H      _SFR_MEM8 (0x004D) /* Timer/Counter1 Bytes HIGH BYTE */
#define TC16_TCCR1B      _SFR_MEM8 (0x004E) /* Timer/Counter1 Control Register B */
#define TC16_TCCR1A      _SFR_MEM8 (0x004F) /* Timer/Counter1 Control Register A */
#define TC16_TIFR        _SFR_MEM8 (0x0058) /* Timer/Counter Interrupt Flag register */
#define TC16_TIMSK       _SFR_MEM8 (0x0059) /* Timer/Counter Interrupt Mask Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE       _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_MCUCSR     _SFR_MEM8 (0x0054) /* MCU Control And Status Register */
#define EXINT_MCUCR      _SFR_MEM8 (0x0055) /* General Interrupt Control Register */
#define EXINT_GIFR       _SFR_MEM8 (0x005A) /* General Interrupt Flag Register */
#define EXINT_GICR       _SFR_MEM8 (0x005B) /* General Interrupt Control Register */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE      _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR      _SFR_MEM8 (0x003C) /* EEPROM Control Register */
#define EEPROM_EEDR      _SFR_MEM8 (0x003D) /* EEPROM Data Register */
#define EEPROM_EEAR      _SFR_MEM16(0x003E) /* EEPROM Address Register Bytes */
#define EEPROM_EEARL     _SFR_MEM8 (0x003E) /* EEPROM Address Register Bytes LOW BYTE */
#define EEPROM_EEARH     _SFR_MEM8 (0x003F) /* EEPROM Address Register Bytes HIGH BYTE */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE         _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_SFIOR        _SFR_MEM8 (0x0050) /* Special function I/O register */
#define CPU_OSCCAL       _SFR_MEM8 (0x0051) /* Oscillator Calibration Value */
#define CPU_MCUCSR       _SFR_MEM8 (0x0054) /* MCU Control And Status Register */
#define CPU_MCUCR        _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SP           _SFR_MEM16(0x005D) /* Stack Pointer  */
#define CPU_SPL          _SFR_MEM8 (0x005D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH          _SFR_MEM8 (0x005E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG         _SFR_MEM8 (0x005F) /* Status Register */

/* TC2 - Timer/Counter, 8-bit Async (0x0000) */
#define TC8_ASYNC_BASE   _SFR_MEM8 (0x0000) /* TC8_ASYNC Base Address */
#define TC8_ASYNC_ASSR   _SFR_MEM8 (0x0042) /* Asynchronous Status Register */
#define TC8_ASYNC_OCR2   _SFR_MEM8 (0x0043) /* Timer/Counter2 Output Compare Register */
#define TC8_ASYNC_TCNT2  _SFR_MEM8 (0x0044) /* Timer/Counter2 */
#define TC8_ASYNC_TCCR2  _SFR_MEM8 (0x0045) /* Timer/Counter2 Control Register */
#define TC8_ASYNC_SFIOR  _SFR_MEM8 (0x0050) /* Special Function IO Register */
#define TC8_ASYNC_TIFR   _SFR_MEM8 (0x0058) /* Timer/Counter Interrupt Flag Register */
#define TC8_ASYNC_TIMSK  _SFR_MEM8 (0x0059) /* Timer/Counter Interrupt Mask register */

/* SPI - Serial Peripheral Interface (0x0000) */
#define SPI_BASE         _SFR_MEM8 (0x0000) /* SPI Base Address */
#define SPI_SPCR         _SFR_MEM8 (0x002D) /* SPI Control Register */
#define SPI_SPSR         _SFR_MEM8 (0x002E) /* SPI Status Register */
#define SPI_SPDR         _SFR_MEM8 (0x002F) /* SPI Data Register */

