stevenj/avr-libc3/include/avr/io/atmega16a.h
/* USART - USART (0x0000) */
#define USART_BASE       _SFR_MEM8 (0x0000) /* USART Base Address */
#define USART_UBRRL      _SFR_MEM8 (0x0029) /* USART Baud Rate Register */
#define USART_UCSRB      _SFR_MEM8 (0x002A) /* USART Control and Status Register B */
#define USART_UCSRA      _SFR_MEM8 (0x002B) /* USART Control and Status Register A */
#define USART_UDR        _SFR_MEM8 (0x002C) /* USART I/O Data Register */
#define USART_UCSRC      _SFR_MEM8 (0x0040) /* USART Control and Status Register C */
#define USART_UBRRH      _SFR_MEM8 (0x0040) /* USART Baud Rate Register */

/* TWI - Two Wire Serial Interface (0x0000) */
#define TWI_BASE         _SFR_MEM8 (0x0000) /* TWI Base Address */
#define TWI_TWBR         _SFR_MEM8 (0x0020) /* TWI Bit Rate register */
#define TWI_TWSR         _SFR_MEM8 (0x0021) /* TWI Status Register */
#define TWI_TWAR         _SFR_MEM8 (0x0022) /* TWI (Slave) Address register */
#define TWI_TWDR         _SFR_MEM8 (0x0023) /* TWI Data register */
#define TWI_TWCR         _SFR_MEM8 (0x0056) /* TWI Control Register */

/* AC - Analog Comparator (0x0000) */
#define AC_BASE          _SFR_MEM8 (0x0000) /* AC Base Address */
#define AC_ACSR          _SFR_MEM8 (0x0028) /* Analog Comparator Control And Status Register */
#define AC_SFIOR         _SFR_MEM8 (0x0050) /* Special Function IO Register */

/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE         _SFR_MEM16(0x0000) /* ADC Base Address */
#define ADC_ADC          _SFR_MEM16(0x0024) /* ADC Data Register Bytes */
#define ADC_ADCL         _SFR_MEM8 (0x0024) /* ADC Data Register Bytes LOW BYTE */
#define ADC_ADCH         _SFR_MEM8 (0x0025) /* ADC Data Register Bytes HIGH BYTE */
#define ADC_ADCSRA       _SFR_MEM8 (0x0026) /* The ADC Control and Status register */
#define ADC_ADMUX        _SFR_MEM8 (0x0027) /* The ADC multiplexer Selection Register */
#define ADC_SFIOR        _SFR_MEM8 (0x0050) /* Special Function IO Register */

/* JTAG - JTAG Interface (0x0000) */
#define JTAG_BASE        _SFR_MEM8 (0x0000) /* JTAG Base Address */
#define JTAG_OCDR        _SFR_MEM8 (0x0051) /* On-Chip Debug Related Register in I/O Memory */
#define JTAG_MCUCSR      _SFR_MEM8 (0x0054) /* MCU Control And Status Register */

/* BOOT_LOAD - Bootloader (0x0000) */
#define BOOT_LOAD_BASE   _SFR_MEM8 (0x0000) /* BOOT_LOAD Base Address */
#define BOOT_LOAD_SPMCSR _SFR_MEM8 (0x0057) /* Store Program Memory Control Register */

/* PORTA - I/O Port (0x0000) */
#define PORTAA_BASE      _SFR_MEM8 (0x0000) /* PORTAA Base Address */
#define PORTAA_PINA      _SFR_MEM8 (0x0039) /* Port A Input Pins */
#define PORTAA_DDRA      _SFR_MEM8 (0x003A) /* Port A Data Direction Register */
#define PORTAA_PORTA     _SFR_MEM8 (0x003B) /* Port A Data Register */

/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE      _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB      _SFR_MEM8 (0x0036) /* Port B Input Pins */
#define PORTBB_DDRB      _SFR_MEM8 (0x0037) /* Port B Data Direction Register */
#define PORTBB_PORTB     _SFR_MEM8 (0x0038) /* Port B Data Register */

/* PORTC - I/O Port (0x0000) */
#define PORTCC_BASE      _SFR_MEM8 (0x0000) /* PORTCC Base Address */
#define PORTCC_PINC      _SFR_MEM8 (0x0033) /* Port C Input Pins */
#define PORTCC_DDRC      _SFR_MEM8 (0x0034) /* Port C Data Direction Register */
#define PORTCC_PORTC     _SFR_MEM8 (0x0035) /* Port C Data Register */

/* PORTD - I/O Port (0x0000) */
#define PORTDD_BASE      _SFR_MEM8 (0x0000) /* PORTDD Base Address */
#define PORTDD_PIND      _SFR_MEM8 (0x0030) /* Port D Input Pins */
#define PORTDD_DDRD      _SFR_MEM8 (0x0031) /* Port D Data Direction Register */
#define PORTDD_PORTD     _SFR_MEM8 (0x0032) /* Port D Data Register */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE         _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCR        _SFR_MEM8 (0x0041) /* Watchdog Timer Control Register */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE        _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW         _SFR_MEM8 (0x0000) 
#define FUSE_HIGH        _SFR_MEM8 (0x0001) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE     _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT  _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num        (0)                 
#define None_RESET_vect            _VECTOR(0)          /* External Pin, Power-on Reset, Brown-out Reset, Watchdog Reset and JTAG AVR Reset */
#define None_INT0_vect_num         (1)                 
#define None_INT0_vect             _VECTOR(1)          /* External Interrupt Request 0 */
#define None_INT1_vect_num         (2)                 
#define None_INT1_vect             _VECTOR(2)          /* External Interrupt Request 1 */
#define None_TIMER2_COMP_vect_num  (3)                 
#define None_TIMER2_COMP_vect      _VECTOR(3)          /* Timer/Counter2 Compare Match */
#define None_TIMER2_OVF_vect_num   (4)                 
#define None_TIMER2_OVF_vect       _VECTOR(4)          /* Timer/Counter2 Overflow */
#define None_TIMER1_CAPT_vect_num  (5)                 
#define None_TIMER1_CAPT_vect      _VECTOR(5)          /* Timer/Counter1 Capture Event */
#define None_TIMER1_COMPA_vect_num (6)                 
#define None_TIMER1_COMPA_vect     _VECTOR(6)          /* Timer/Counter1 Compare Match A */
#define None_TIMER1_COMPB_vect_num (7)                 
#define None_TIMER1_COMPB_vect     _VECTOR(7)          /* Timer/Counter1 Compare Match B */
#define None_TIMER1_OVF_vect_num   (8)                 
#define None_TIMER1_OVF_vect       _VECTOR(8)          /* Timer/Counter1 Overflow */
#define None_TIMER0_OVF_vect_num   (9)                 
#define None_TIMER0_OVF_vect       _VECTOR(9)          /* Timer/Counter0 Overflow */
#define None_SPI_STC_vect_num      (10)                
#define None_SPI_STC_vect          _VECTOR(10)         /* Serial Transfer Complete */
#define None_USART_RXC_vect_num    (11)                
#define None_USART_RXC_vect        _VECTOR(11)         /* USART, Rx Complete */
#define None_USART_UDRE_vect_num   (12)                
#define None_USART_UDRE_vect       _VECTOR(12)         /* USART Data Register Empty */
#define None_USART_TXC_vect_num    (13)                
#define None_USART_TXC_vect        _VECTOR(13)         /* USART, Tx Complete */
#define None_ADC_vect_num          (14)                
#define None_ADC_vect              _VECTOR(14)         /* ADC Conversion Complete */
#define None_EE_RDY_vect_num       (15)                
#define None_EE_RDY_vect           _VECTOR(15)         /* EEPROM Ready */
#define None_ANA_COMP_vect_num     (16)                
#define None_ANA_COMP_vect         _VECTOR(16)         /* Analog Comparator */
#define None_TWI_vect_num          (17)                
#define None_TWI_vect              _VECTOR(17)         /* 2-wire Serial Interface */
#define None_INT2_vect_num         (18)                
#define None_INT2_vect             _VECTOR(18)         /* External Interrupt Request 2 */
#define None_TIMER0_COMP_vect_num  (19)                
#define None_TIMER0_COMP_vect      _VECTOR(19)         /* Timer/Counter0 Compare Match */
#define None_SPM_RDY_vect_num      (20)                
#define None_SPM_RDY_vect          _VECTOR(20)         /* Store Program Memory Ready */

/* Vector Table Size */
#define _VECTOR_SIZE               (4)                 /* Size of individual vector. */
#define _VECTORS_SIZE              (21 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

